Repository: DG0BAB/Backchat
Catalog: Sources/Resources/*.lproj/NetworkServiceErrors.strings
Languages: de

source: NetworkServiceError.OK
de: OK

source: NetworkServiceError.Cancel
de: Abbrechen

source: NetworkServiceError.preparingRequest
de: Request erstellen

source: NetworkServiceError.preparingRequest.failure.Missing relative path in request
de: Kein relativer Pfad gefunden.

source: NetworkServiceError.preparingRequest.failure.Couldn't create URL from given @(url) and base @(base).
de: URL aus @(url) relativ zur Basis @(base) konnte nicht erstellt werden.

source: NetworkServiceError.sendingRequest
de: Request gesendet

source: NetworkServiceError.sendingRequest.failure.Got error @(error) after sending request.
de: - Fehler @(error) ist aufgetreten.

source: NetworkServiceError.cancelled
de: Abgebrochen

source: NetworkServiceError.cancelled.failure.Request @(request) was cancelled
de: Der Request @(request) wurde abgebochen.

source: NetworkServiceError.response
de: Response empfangen

source: NetworkServiceError.response.failure.Received illegal response @(response)
de: Illegaler Respnse: @(response)

source: NetworkServiceError.response.failure.Received client error with status code @(code)
de: Client status @(code) wurde empfangen.

source: NetworkServiceError.response.failure.Received server error with status code @(code)
de: Server status @(code) wurde empfangen.

source: NetworkServiceError.response.failure.Received response with status code @(code)
de: Status @(code).

source: NetworkServiceError.response.failure.Insufficient data
de: Nicht genügend Daten empfangen.

source: NetworkServiceError.cancelled.failure.Request was cancelled
de: Der Request wurde abgebrochen
